# Código de inicialización
Este código permite inicializar las bibliotecas para usar SQLite en la máquina virtual de Google Colab. El código además elimina cualquier dato almacenado anteriormente en el archvio `ejemplos.db`. Es recomendable volver a correr el código cada vez que se comience con la resolución de un nuevo ejercicio.

In [1]:
!pip install pymysql
%load_ext sql
!rm -rf ejemplos.db
%sql sqlite:///ejemplos.db

Collecting pymysql
  Downloading PyMySQL-1.1.1-py3-none-any.whl.metadata (4.4 kB)
Downloading PyMySQL-1.1.1-py3-none-any.whl (44 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 45.0/45.0 kB 1.6 MB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.1

# TP2: Ejercicios de SQL


## EJERCICIO 1:  Base de datos para un club náutico

### Descripción:
Se quiere diseñar una base de datos relacional para gestionar los datos de los socios de un club náutico. De cada socio se guardan los datos personales y la información de los barcos que posee:
- Número de matrícula, nombre, número de amarre, cuota.

Además, se almacena información sobre las salidas realizadas por cada barco:
- Fecha y hora de salida, destino y datos del patrón (que no tiene que ser el propietario ni un socio del club).

### Esquema propuesto:
- Tabla `Socios`: Almacena la información de los socios del club.
- Tabla `Barcos`: Almacena la información de los barcos y sus propietarios.
- Tabla `Salidas`: Almacena la información de las salidas realizadas por los barcos.

### Esquema de tablas
Este sería el esquema de tablas en lenguaje DBML

```dbml
Table Socios {
    id_socio INT [pk]
    nombre VARCHAR(100)
    direccion VARCHAR(255)
}

Table Barcos {
    matricula VARCHAR(20) [pk]
    nombre VARCHAR(100)
    numero_amarre INT
    cuota DECIMAL(10, 2)
    id_socio INT [ref: > Socios.id_socio]
}

Table Salidas {
    id_salida INT [pk]
    matricula VARCHAR(20) [ref: > Barcos.matricula]
    fecha_salida DATE
    hora_salida TIME
    destino VARCHAR(100)
    patron_nombre VARCHAR(100)
    patron_direccion VARCHAR(255)
}
```

### Escriba abajo el código SQL necesario para crear las tablas:

In [9]:
%%sql
CREATE TABLE Socios (
    id_socio INT PRIMARY KEY,
    nombre VARCHAR(100) NOT NULL,
    direccion VARCHAR(255) NOT NULL
);


CREATE TABLE Barcos (
    matricula VARCHAR(20) PRIMARY KEY,
    nombre VARCHAR(100) NOT NULL,
    numero_amarre INT NOT NULL,
    cuota DECIMAL(10, 2) NOT NULL,
    id_socio INT,
    FOREIGN KEY (id_socio) REFERENCES Socios(id_socio)
);


CREATE TABLE Salidas (
    id_salida INT PRIMARY KEY,
    matricula VARCHAR(20),
    fecha_salida DATE NOT NULL,
    hora_salida TIME NOT NULL,
    destino VARCHAR(100) NOT NULL,
    patron_nombre VARCHAR(100) NOT NULL,
    patron_direccion VARCHAR(255) NOT NULL,
    FOREIGN KEY (matricula) REFERENCES Barcos(matricula)
);

 * sqlite:///ejemplos.db
Done.
Done.
Done.

[]

El código SQL de abajo le permite popular (es decir, rellenar) las tablas con datos.

In [10]:
%%sql
-- Populación de las tablas
INSERT INTO Socios (id_socio, nombre, direccion)
VALUES
(1, 'Juan Pérez', 'Calle Mayor 1, Madrid'),
(2, 'Ana García', 'Calle Luna 5, Barcelona'),
(3, 'Luis Fernández', 'Avenida del Sol 10, Valencia'),
(4, 'Laura Sánchez', 'Plaza del Mar 3, Alicante'),
(5, 'Carlos López', 'Calle Río 8, Sevilla'),
(6, 'Marta Díaz', 'Calle de la Sierra 12, Zaragoza'),
(7, 'Pedro Gómez', 'Calle Nueva 20, Bilbao'),
(8, 'Lucía Jiménez', 'Calle Real 30, Madrid'),
(9, 'María Torres', 'Calle Verde 15, Málaga'),
(10, 'Fernando Martín', 'Calle Azul 25, Murcia');

INSERT INTO Barcos (matricula, nombre, numero_amarre, cuota, id_socio)
VALUES
('ABC123', 'El Viento', 12, 600.50, 1),
('DEF456', 'La Brisa', 8, 450.00, 2),
('GHI789', 'El Sol', 15, 700.00, 3),
('JKL012', 'El Mar', 10, 550.75, 4),
('MNO345', 'La Luna', 18, 620.30, 5),
('PQR678', 'El Horizonte', 20, 780.90, 6),
('STU901', 'El Amanecer', 5, 400.00, 7),
('VWX234', 'La Estrella', 7, 520.50, 8),
('YZA567', 'La Marea', 14, 480.75, 9),
('BCD890', 'El Océano', 6, 630.80, 10);

INSERT INTO Salidas (id_salida, matricula, fecha_salida, hora_salida, destino, patron_nombre, patron_direccion)
VALUES
(1, 'ABC123', '2023-07-15', '10:30:00', 'Mallorca', 'Patrón 1', 'Calle de la Playa 1, Palma'),
(2, 'DEF456', '2023-07-20', '09:00:00', 'Ibiza', 'Patrón 2', 'Avenida del Puerto 3, Valencia'),
(3, 'GHI789', '2023-07-22', '08:45:00', 'Menorca', 'Patrón 3', 'Calle de la Costa 10, Alicante'),
(4, 'JKL012', '2023-07-25', '11:15:00', 'Mallorca', 'Patrón 4', 'Plaza del Faro 5, Barcelona'),
(5, 'MNO345', '2023-08-01', '14:00:00', 'Formentera', 'Patrón 5', 'Calle del Puerto 20, Ibiza'),
(6, 'PQR678', '2023-08-05', '07:30:00', 'Mallorca', 'Patrón 6', 'Calle de las Olas 15, Palma'),
(7, 'STU901', '2023-08-10', '12:00:00', 'Ibiza', 'Patrón 7', 'Avenida de la Marina 7, Barcelona'),
(8, 'VWX234', '2023-08-12', '09:30:00', 'Cabrera', 'Patrón 8', 'Calle del Mar 12, Alicante'),
(9, 'YZA567', '2023-08-15', '10:00:00', 'Formentera', 'Patrón 9', 'Calle del Sol 4, Ibiza'),
(10, 'BCD890', '2023-08-20', '08:00:00', 'Menorca', 'Patrón 10', 'Plaza del Faro 2, Palma');

 * sqlite:///ejemplos.db
10 rows affected.
10 rows affected.
10 rows affected.

[]

### Resolver estas consignas sin usar JOIN:
Estas consirgnas deben resolverse usando lo visto en la clase del lunes 16/09 antes de ver la parte de JOIN. Esto es: subconsultas, etc.
1. ¿Qué socios tienen barcos amarrados en un número de amarre mayor que 10?

In [ ]:
%%sql
SELECT nombre from Socios WHERE id_socio IN (SELECT id_socio from Barcos WHERE numero_amarre > 10);

 * sqlite:///ejemplos.db
Done.

[('Juan Pérez',),
 ('Luis Fernández',),
 ('Carlos López',),
 ('Marta Díaz',),
 ('María Torres',)]

2. ¿Cuáles son los nombres de los barcos y sus cuotas de aquellos barcos cuyo socio se llama 'Juan Pérez'?

In [ ]:
%%sql
SELECT nombre, cuota FROM Barcos WHERE id_socio IN (SELECT id_socio FROM Socios WHERE nombre = 'Juan Pérez');

 * sqlite:///ejemplos.db
Done.

[('El Viento', 600.5)]

3. ¿Cuántas salidas ha realizado el barco con matrícula 'ABC123'?

In [ ]:
%%sql
SELECT fecha_salida From Salidas WHERE matricula  = 'ABC123'
--SELECT COUNT(fecha_salida) AS num_salidas FROM Salidas WHERE matricula = 'ABC123'; cuentas las fechas de salida y las guarda en num_salida

 * sqlite:///ejemplos.db
Done.

[('2023-07-15',)]

4. Lista los barcos que tienen una cuota mayor a 500 y sus respectivos socios.

In [ ]:
%%sql
  SELECT nombre from Socios WHERE id_socio IN (SELECT id_socio from Barcos WHERE cuota > 500)

 * sqlite:///ejemplos.db
Done.

[('Juan Pérez',),
 ('Luis Fernández',),
 ('Laura Sánchez',),
 ('Carlos López',),
 ('Marta Díaz',),
 ('Lucía Jiménez',),
 ('Fernando Martín',)]

5. ¿Qué barcos han salido con destino a 'Mallorca'?

In [ ]:
%%sql
SELECT nombre from Barcos WHERE matricula IN (SELECT matricula FROM Salidas WHERE destino = 'Mallorca')

 * sqlite:///ejemplos.db
Done.

[('El Viento',), ('El Mar',), ('El Horizonte',)]

6. ¿Qué patrones (nombre y dirección) han llevado un barco cuyo socio vive en 'Barcelona'?

In [11]:
%%sql
SELECT patron_nombre, patron_direccion
from Salidas
WHERE matricula IN(SELECT matricula FROM Barcos WHERE id_socio IN(SELECT id_socio from Socios WHERE direccion LIKE '%Barcelona%'))

 * sqlite:///ejemplos.db
Done.

[]

### Resolver nuevamentos los incisos, pero ahora usa JOIN
1. ¿Qué socios tienen barcos amarrados en un número de amarre mayor que 10?

In [ ]:
%%sql
SELECT So.nombre FROM Socios So JOIN Barcos B ON So.id_socio = B.id_socio WHERE B.numero_amarre > 10;

 * sqlite:///ejemplos.db
Done.

[('Juan Pérez',),
 ('Luis Fernández',),
 ('Carlos López',),
 ('Marta Díaz',),
 ('María Torres',)]

2. ¿Cuáles son los nombres de los barcos y sus cuotas de aquellos barcos cuyo socio se llama 'Juan Pérez'?

In [ ]:
%%sql
SELECT B.nombre, B.cuota FROM Barcos B JOIN Socios So On  So.id_socio = B.id_socio WHERE  So.nombre = 'Juan Pérez';

 * sqlite:///ejemplos.db
Done.

[('El Viento', 600.5)]

3. ¿Cuántas salidas ha realizado el barco con matrícula 'ABC123'?

In [ ]:
%%sql
SELECT Sa.fecha_salida From Salidas Sa JOIN Barcos B ON Sa.matricula = B.matricula WHERE B.matricula  = 'ABC123'

 * sqlite:///ejemplos.db
Done.

[('2023-07-15',)]

4. Lista los barcos que tienen una cuota mayor a 500 y sus respectivos socios.

In [ ]:
%%sql
SELECT So.nombre from Socios So JOIN Barcos B ON So.id_socio = B.id_socio WHERE B.cuota > 500

 * sqlite:///ejemplos.db
Done.

[('Juan Pérez',),
 ('Luis Fernández',),
 ('Laura Sánchez',),
 ('Carlos López',),
 ('Marta Díaz',),
 ('Lucía Jiménez',),
 ('Fernando Martín',)]

5. ¿Qué barcos han salido con destino a 'Mallorca'?

In [ ]:
%%sql
SELECT B.nombre from Barcos B JOIN Salidas Sa ON B.matricula = Sa.matricula  WHERE Sa.destino = 'Mallorca'

 * sqlite:///ejemplos.db
Done.

[('El Viento',), ('El Mar',), ('El Horizonte',)]

6. ¿Qué patrones (nombre y dirección) han llevado un barco cuyo socio vive en 'Barcelona'?

In [12]:
%%sql
SELECT Sa.patron_nombre, Sa.patron_direccion
FROM Salidas Sa
JOIN Barcos B ON Sa.matricula = B.matricula
JOIN Socios So ON B.id_socio = So.id_socio
WHERE So.direccion LIKE '%Barcelona%';

 * sqlite:///ejemplos.db
Done.

[('Patrón 2', 'Avenida del Puerto 3, Valencia')]


## EJERCICIO 2: Base de datos para un gabinete de abogados

### Descripción:
Se quiere diseñar una base de datos relacional para almacenar información sobre los asuntos que lleva un gabinete de abogados. Cada asunto tiene un número de expediente que lo identifica y corresponde a un solo cliente. Del asunto se debe almacenar:
- Período (fecha de inicio y fecha de archivo o finalización)
- Estado (en trámite, archivado, etc.)
- Datos personales del cliente (DNI, nombre, dirección, etc.)

Algunos asuntos son llevados por uno o varios procuradores, de los que nos interesa también almacenar los datos personales.

### Esquema propuesto:
- Tabla `Clientes`: Almacena la información de los clientes: dni (clave primaria), nombre y dirección.
- Tabla `Asuntos`: Almacena la información de los asuntos: numero de expediente (clave primaria), dni del cliente (clave externa), fecha de inicio, fecha de fin y estado (Abierto o Cerrado). Si el asunto está abierto, no tiene fecha de fin.
- Tabla `Procuradores`: Almacena la información de los procuradores: id del procurador (clave priaria), nombre y dirección.
- Tabla `Asuntos_Procuradores`: Relaciona los asuntos con los procuradores (muchos a muchos).

### SQL para crear las tablas:

In [2]:
%%sql
CREATE TABLE Clientes(
  dni_cliente INT PRIMARY KEY,
  nombre VARCHAR(50) NOT NULL,
  direccion VARCHAR(200)NOT NULL
);

CREATE TABLE Asuntos(
numero_expediente  INT PRIMARY KEY,
dni_cliente INT,
fecha_inicio DATE NOT NULL,
fecha_fin DATE,
estado BOOLEAN NOT NULL, -- ture para abierto, false para cerrado
FOREIGN KEY (dni_cliente) REFERENCES Clientes(dni_cliente)

);

CREATE TABLE Procuradores(
  id_procurador INT PRIMARY KEY,
  nombre VARCHAR(50),
  direccion VARCHAR(200)
);
CREATE TABLE Asuntos_Procuradores(
  numero_expediente INT,
  id_procurador INT,
  PRIMARY KEY (numero_expediente, id_procurador), -- clave primaria compuesta, asigno varios procuradores a un mismo asunto sin duplicar registros
  FOREIGN KEY (numero_expediente) REFERENCES Asuntos(numero_expediente)--un asunto puede tener varios procuradores y un procurador puede trabajar en varios asuntos
);

 * sqlite:///ejemplos.db
Done.
Done.
Done.
Done.

[]

In [3]:
%%sql
-- Poblar la tabla Clientes
INSERT INTO Clientes (dni_cliente, nombre, direccion)
VALUES
('123456789', 'Juan Pérez', 'Calle Pueyrredón 3498, Buenos Aires'),
('987654321', 'Ana García', 'Calle 5 323, La Plata'),
('456123789', 'Luis Fernández', 'Avenida de Gral. Paz 1056, Bahía Blanca'),
--AGREGO MAS valores
('112233445', 'María López', 'Calle Mendoza 1200, Córdoba'),
('223344556', 'Pedro Sánchez', 'Avenida Libertador 4550, Rosario'),
('334455667', 'Laura Martínez', 'Calle San Martín 789, Mendoza'),
('445566778', 'Carlos Gómez', 'Calle Rivadavia 400, Tucumán'),
('556677889', 'Sofía Ramírez', 'Avenida 9 de Julio 2500, Buenos Aires'),
('667788990', 'Javier Torres', 'Calle Colón 880, Salta'),
('778899001', 'Claudia Morales', 'Calle Florida 101, Buenos Aires'),
('889900112', 'Diego Ruiz', 'Avenida San Juan 3000, La Plata'),
('990011223', 'Verónica Díaz', 'Calle Caseros 1500, San Miguel'),
('101112131', 'Alejandro Romero', 'Avenida de Mayo 220, Buenos Aires');

-- Poblar la tabla Asuntos
INSERT INTO Asuntos (numero_expediente, dni_cliente, fecha_inicio, fecha_fin, estado)
VALUES
(1, '123456789', '2023-01-15', '2023-07-20', FALSE), -- estado boolean
(2, '987654321', '2023-05-10', NULL, TRUE),
(3, '456123789', '2023-06-01', '2023-09-10', FALSE),
-- agrego mas
(4, '112233445', '2023-02-20', '2023-08-15', FALSE),
(5, '223344556', '2023-04-05', NULL, TRUE),
(6, '334455667', '2023-03-10', '2023-09-25', FALSE),
(7, '445566778', '2023-06-12', NULL, TRUE),
(8, '556677889', '2023-07-01', '2023-09-30', FALSE),
(9, '667788990', '2023-08-14', NULL, TRUE),
(10, '778899001', '2023-01-29', '2023-04-30', FALSE),
(11, '889900112', '2023-05-20', NULL, TRUE),
(12, '990011223', '2023-06-18', '2023-08-31', FALSE),
(13, '101112131', '2023-03-25', NULL, TRUE);

-- Poblar la tabla Procuradores
INSERT INTO Procuradores (id_procurador, nombre, direccion)
VALUES
(1, 'Laura Sánchez', 'Calle Soler 3765, Buenos Aires'),
(2, 'Carlos López', 'Calle Estrellas 8, Mar del Plata'),
(3, 'Marta Díaz', 'Calle Estación 12, Olavarria'),
--agrego
(4, 'Fernando Gómez', 'Calle Santa Fe 4500, Córdoba'),
(5, 'Ana Torres', 'Avenida Brasil 1200, Rosario'),
(6, 'Javier Martínez', 'Calle Libertad 998, La Plata'),
(7, 'Sofía Ramírez', 'Calle La Rioja 234, Salta'),
(8, 'Diego Fernández', 'Avenida Juan B. Justo 3456, Mendoza'),
(9, 'Claudia Morales', 'Calle Alsina 128, San Miguel'),
(10, 'Ricardo Hernández', 'Avenida 9 de Julio 2100, Buenos Aires'),
(11, 'Verónica Ruiz', 'Calle Rivadavia 333, Tucumán'),
(12, 'Pedro Sánchez', 'Calle Avellaneda 900, Bahía Blanca');

-- Poblar la tabla Asuntos_Procuradores
INSERT INTO Asuntos_Procuradores (numero_expediente, id_procurador)
VALUES
(1, 1),--expediente, procurador
(2, 2),
(3, 3),
(2, 1), -- Un asunto puede tener varios procuradores
--agrego
(4, 5),
(5, 8),
(6, 9),
(4, 12),
(7, 4),
(8, 7),
(9, 11),
(10, 8),
(11, 3),
(12, 2);

 * sqlite:///ejemplos.db
13 rows affected.
13 rows affected.
12 rows affected.
14 rows affected.

[]

### Resolver estas consignas usando _únicamente_ JOIN en las consultas:
1. ¿Cuál es el nombre y la dirección de los procuradores que han trabajado en un asunto abierto?

In [4]:
%%sql
SELECT P.nombre, P.direccion
FROM Procuradores P
JOIN Asuntos_Procuradores AP ON P.id_procurador = AP.id_procurador
JOIN Asuntos A ON AP.numero_expediente = A.numero_expediente
WHERE A.estado = TRUE;

 * sqlite:///ejemplos.db
Done.

[('Carlos López', 'Calle Estrellas 8, Mar del Plata'),
 ('Laura Sánchez', 'Calle Soler 3765, Buenos Aires'),
 ('Carlos López', 'Calle Estrellas 8, Mar del Plata'),
 ('Laura Sánchez', 'Calle Soler 3765, Buenos Aires'),
 ('Carlos López', 'Calle Estrellas 8, Mar del Plata'),
 ('Marta Díaz', 'Calle Estación 12, Olavarria')]

2. ¿Qué clientes han tenido asuntos en los que ha participado el procurador Carlos López?

In [5]:
%%sql
SELECT C.nombre
FROM Clientes C
JOIN Asuntos A ON C.dni_cliente = A.dni_cliente
JOIN Asuntos_Procuradores AP ON A.numero_expediente = AP.numero_expediente
JOIN Procuradores P ON AP.id_procurador= P.id_procurador
WHERE P.nombre = 'Carlos López'

 * sqlite:///ejemplos.db
Done.

[('Ana García',),
 ('Pedro Sánchez',),
 ('María López',),
 ('Javier Torres',),
 ('Verónica Díaz',)]

3. ¿Cuántos asuntos ha gestionado cada procurador?

In [8]:
%%sql
SELECT P.nombre, COUNT(AP.numero_expediente) AS total_asuntos
FROM Procuradores P
JOIN Asuntos_Procuradores AP ON P.id_procurador = AP.id_procurador
GROUP BY P.nombre;-- Agrupo por el nombre del procurador para obtener el número total de asuntos gestionados por cada uno

 * sqlite:///ejemplos.db
Done.

[('Carlos López', 5), ('Laura Sánchez', 5), ('Marta Díaz', 4)]

4. Lista los números de expediente y fechas de inicio de los asuntos de los clientes que viven en Buenos Aires.

In [7]:
%%sql
SELECT A.numero_expediente, A.fecha_inicio
FROM Asuntos A
JOIN Clientes C ON A.dni_cliente = C.dni_cliente
WHERE C.direccion LIKE '%Buenos Aires%';

 * sqlite:///ejemplos.db
Done.

[(1, '2023-01-15'), (8, '2023-07-01'), (10, '2023-01-29'), (13, '2023-03-25')]

# Entrega
La entrega consiste en completar esta hoja y subirla a su repositorio GIT
Se deben entregar también los diagramas de esquema de tablas como imagenes aparte.
Fecha límite: 30 de septiembre a las 23:59 hs